index=* (EventCode=4625 OR EventCode=4624)
| stats count(eval(EventCode=4625)) as Failed_Logins, count(eval(EventCode=4624)) as Successful_Logins, values(TargetUserName) as Attempted_Users by IpAddress
| where Failed_Logins > 10
